let initialState = {
    a:[
        {},
        {id:1,
            text:"У яких випадках дозволене подавання звукового сигналу?",
            answers:[
                "Для привертання уваги водія під час обгону транспортного засобу на дорогах поза населеними пунктами.",
                "У випадках, коли без цього неможливо запобігти дорожньо-транспортній пригоді.",
                "Для привертання уваги водія під час обгону транспортного засобу на дорогах у населених пунктах.",
                "Відповіді 1, 2 і 3.",
                "Відповіді 1 і 2."
            ],
            trueAnswer:"Відповіді 1 і 2."
        },
        {id:2,
            text:"Чи дозволяється навчальна їзда на автомагістралі?",
            answers:[
                "Дозволяється.",
                "Забороняється.",
                "Дозволяється лише у світлу пору доби."
            ],
            trueAnswer:"Забороняється."
        },
        {id:3,
            text:"Яких видів буває дорожня розмітка?",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:4,
            text:"",
            answers:[
                "Горизонтальна.",
                "Вертикальна.",
                "Діагональна.",
                "Горизонтальна і вертикальна."
            ],
            trueAnswer:"Горизонтальна і вертикальна."
        },
        {id:5,
            text:"Зупинка венозної кровотечі як правило проводиться:",
            answers:[
                "Накладанням пов’язки, що тисне.",
                "За допомогою кровоспинного джгута.",
                "Як правило, зупиняється самостійно.\n"
            ],
            trueAnswer:"Накладанням пов’язки, що тисне."
        },
        {id:6,
            text:"Коли водієві необхідно припинити подавання сигналу рукою?",
            answers:[
                "Безпосередньо перед початком виконання маневру.",
                "Відразу після завершення маневру.",
                "Під час виконання маневру."
            ],
            trueAnswer:"Безпосередньо перед початком виконання маневру."
        },
        {id:7,
            text:"Що сприяє недопущенню неконтрольованого биття колеса на швидкості (воблінгу)?",
            answers:[
                "Встановлення рульового демпферу для компенсації коливань.",
                "Балансування переднього колеса, встановлення якісної шини.",
                "Справністю передньої вилки, правильний підбір жорсткості амортизатора.",
                "Все, перелічене вище.",
            ],
            trueAnswer:"Все, перелічене вище."
        },
        {id:8,
            text:"Коли на задньому сидінні мотоцикла є пасажир, як це позначається на ходових якостях мотоцикла?",
            answers:[
                "Може змінитися траекторія руху мотоцикла при гальмуванні.",
                "Ніяк не позначається.\n",
            ],
            trueAnswer:"Може змінитися траекторія руху мотоцикла при гальмуванні."
        },
        {id:9,
            text:"Чому заднє колесо мотоцикла при гальмуванні більш схильне до блокування, ніж переднє? Так як при гальмуванні заднє колесо:",
            answers:[
                "Cильніше навантажується.",
                "Розвантажується."
            ],
            trueAnswer:"Розвантажується."
        },
        {id:10,
            text:"У якому місці водій мотоцикла повинен зупинити свій транспортний засіб на залізничному переїзді?",
            answers:[
                "Перед шлагбаумом, якщо немає розмітки \"стоп-лінія\".",
                "Перед дорожньою розміткою «стоп-лінія».",
                "У будь-якому з місць, перелічених вище."
            ],
            trueAnswer:"У будь-якому з місць, перелічених вище."
        },
        {id:11,
            text:"Що дозволяється робити мотоциклістові в разі затору?",
            answers:[
                "Дозволяється проїхати між транспортними засобами ближче до перехрестя.",
                "Дозволяється об'їхати потік, що стоїть, узбіччям.",
                "Зупинитись, оцінити обстановку, продовжити рух лише переконавшись, що подальший шлях вільний для руху.",
            ],
            trueAnswer:"Зупинитись, оцінити обстановку, продовжити рух лише переконавшись, що подальший шлях вільний для руху."
        },
        {id:12,
            text:"Як ви повинні вчинити, якщо під час руху відмовив у роботі спідометр на мотоциклі?",
            answers:[
                "Продовжити намічену поїздку з особливою обережністю.",
                "Припинити подальший рух.",
                "Спробувати усунути несправність на місці, а якщо це неможливо, то слідувати до місця стоянки або ремонту, ввімкнувши аварійну світлову сигналізацію або встановивши ззаду на транспортному засобі знак аварійної зупинки.",
            ],
            trueAnswer:"Спробувати усунути несправність на місці, а якщо це неможливо, то слідувати до місця стоянки або ремонту, ввімкнувши аварійну світлову сигналізацію або встановивши ззаду на транспортному засобі знак аварійної зупинки."
        },
        {id:13,
            text:"Де на мотоциклі встановлюють номерні знаки?",
            answers:[
                "З боків.",
                "Спереду і ззаду.",
                "У передбачених для цього місцях.",
            ],
            trueAnswer:"У передбачених для цього місцях."
        },
        {id:14,
            text:"Порядок дій при масивній артеріальній кровотечі:",
            answers:[
                "Накласти джгут, вказати час накладання, викликати 103.",
                "Викликати 103 і накласти пов'язку, що тисне.",
                "Викликати 103, накласти джгут, вказати час накладання."
            ],
            trueAnswer:"Накласти джгут, вказати час накладання, викликати 103."
        },
        {id:15,
            text:"У постраждалого кровотеча з рани в області шиї. Який метод зупинки кровотечі буде найбільш правильний:",
            answers:[
                "Накладання кровоспинного джгута.",
                "Пальцеве притискання рани.",
                "Накладання тугої бинтової пов’язки.",
            ],
            trueAnswer:"Пальцеве притискання рани."
        },
        {id:16,
            text:"У яких випадках дозволене подавання звукового сигналу?",
            answers:[
                "Для привертання уваги водія під час обгону транспортного засобу на дорогах поза населеними пунктами.",
                "У випадках, коли без цього неможливо запобігти дорожньо-транспортній пригоді.",
                "Для привертання уваги водія під час обгону транспортного засобу на дорогах у населених пунктах.",
                "Відповіді 1, 2 і 3.",
                "Відповіді 1 і 2."
            ],
            trueAnswer:"Відповіді 1 і 2."
        },
        {id:17,
            text:"Як повинен рухатися транспортний засіб, швидкість руху якого не повинна перевищувати 40 км/год. або який з технічних причин не може розвивати таку швидкість?",
            answers:[
                "Повинен рухатися якнайближче до правого краю проїзної частини, крім випадків, коли виконується об'їзд або обгін.",
                "Повинен рухатися якнайближче до правого краю проїзної частини, крім випадків, коли виконується перестроювання перед поворотом ліворуч чи розворотом.",
                "Може рухатися в будь-якій смузі.",
                "Відповіді 1 і 2.",
            ],
            trueAnswer:"Відповіді 1 і 2."
        },
        {id:18,
            text:"З якою максимальною швидкістю дозволено буксирування транспортних засобів?",
            answers:[
                "40 км/год.",
                "50 км/год.",
                "60 км/год.",
                "70 км/год.",
            ],
            trueAnswer:"50 км/год."
        },
        {id:19,
            text:"Коли на задньому сидінні мотоцикла є пасажир, як це позначається на ходових якостях мотоцикла?",
            answers:[
                "Може змінитися траекторія руху мотоцикла при гальмуванні.",
                "Ніяк не позначається."
            ],
            trueAnswer:"Може змінитися траекторія руху мотоцикла при гальмуванні."
        },
        {id:20,
            text:"Для чого необхідно вимірювати густину гальмівної рідини в процесі обслуговування транспортного засобу?",
            answers:[
                "Для перевірки її експлуатаційних властивостей.",
                "Для визначення терміну служби гальмівної рідини.",
                "Для визначення обсягу залитої гальмівної рідини.",
            ],
            trueAnswer:"Для перевірки її експлуатаційних властивостей."
        },

    ],
    b:[
        {},
        {id:1,
            text:"Яких заходів повинен вжити водій транспортного засобу в " +
                "разі вимушеної зупинки на місці, де зупинка заборонена, при " +
                "відсутності можливості прибрати транспортний засіб?",
         answers:[
             "Тільки увімкнути аварійну сигналізацію.",
             "Тільки встановити знак аварійної зупинки або миготливий червоний ліхтар.",
             "Виконати дію з відповіді 1 або 2, а в установлених Правилами випадках - обидві дії одночасно."],
         trueAnswer:"Виконати дію з відповіді 1 або 2, а в установлених Правилами випадках - обидві дії одночасно."
        },
        {id:2,
            text:"Що з переліченого нижче відповідає терміну «видимість у напрямку руху»?",
            answers:[
                "Мінімальна відстань, на якій з місця водія можна побачити «стоп-лінію».",
                "Максимальна відстань вправо від напрямку руху, на якому можна розпізнати транспортні засоби, що наближаються до перехрестя по головній дорозі.\n",
                "Максимальна відстань, на якій з місця водія можна чітко розпізнати межі елементів дороги та розміщення учасників руху, що дає змогу водієві орієнтуватися під час керування транс­портним засобом.\n"],
            trueAnswer:"Максимальна відстань, на якій з місця водія можна чітко розпізнати межі елементів дороги та розміщення учасників руху, що дає змогу водієві орієнтуватися під час керування транс­портним засобом.\n"
        },
        {id:3,
            text:"За наявності якої несправності дозволяється експлуатація транспортного засобу?",
            answers:["Не працюють запори горловин паливних баків.",
                "Не працює склопідйомник.",
                "Не працює пристрій для обігрівання та обдування скла.",
            "Не працює механізм регулювання сидіння водія."],
            trueAnswer:"Не працює склопідйомник."
        },
        {id:4,
            text:"Ви маєте право експлуатувати легковий автомобіль за відсутності:",
            answers:["Знака аварійної зупинки.",
                "Противідкатних упорів.",
                "Вогнегасника.",
                "Аптечки."
            ],
            trueAnswer:"Противідкатних упорів."
        },
        {id:5,
            text:"Адміністративне затримання органами внутрішніх справ проводиться:",
            answers:["Тільки в разі вчинення дрібного хуліганства.",
                "Тільки в разі порушення Правил дорожнього руху.",
                "Проводиться в разі вчинення правопорушень, зазначених у відповідях 1 і 2 з обов'язковим складанням протоколу про затримання."],
            trueAnswer:"Проводиться в разі вчинення правопорушень, зазначених у відповідях 1 і 2 з обов'язковим складанням протоколу про затримання."
        },
        {id:6,
            text:"За які правопорушення Вас може бути позбавлено права керування транспортним засобом?",
            answers:["За керування транспортним засобом в стані алкогольного, наркотичного чи іншого сп'яніння.",
                "За в'їзд на залізничний переїзд у випадках, коли рух через переїзд заборонений.",
                "За порушення правил дорожнього руху, що спричинило пошкодження транспортних засобів, вантажу, автомобільних доріг, вулиць, залізничних переїздів, дорожніх споруд чи іншого майна.",
                "За керування транспортним засобом, не зареєстрованим або не перереєстрованим в установленому порядку.",
                "Відповіді 1,2,3."
            ],

            trueAnswer:"Відповіді 1,2,3."
        },
        {id:7,
            text:"Як найбезпечніше проїхати перехрестя, якщо при наближенні до нього Ви бачите зелений миготливий сигнал світлофора?",
            answers:["Збільшити швидкість, щоб встигнути проїхати перехрестя до ввімкнення заборонного сигналу світлофора.",
                "Завчасно знизити швидкість, щоб у разі потреби зупинитися перед «стоп-лінією» при ввімкненні заборонного сигналу світлофора, не вдаючись до екстреного гальмування.",
                "Не змінювати швидкість руху, а якщо до ввімкнення червоного сигналу проїхати перехрестя не вдасться - загальмувати перед «стоп-лінією»."],
            trueAnswer:"Завчасно знизити швидкість, щоб у разі потреби зупинитися перед «стоп-лінією» при ввімкненні заборонного сигналу світлофора, не вдаючись до екстреного гальмування."
        },
        {id:8,
            text:"Для забезпечення безпеки дорожнього руху водій повинен:",
            answers:["Дотримуватися безпечної дистанції та інтервалу.",
                "Бути пристебнутим і не перевозити пасажирів, не пристебнутих ременями безпеки.",
                "Дотримуватися безпечної швидкості руху.",
                "Відповіді 1, 2 і 3.",
                "Відповіді 1 і 3."
            ],
            trueAnswer:"Відповіді 1, 2 і 3."
        },
        {id:9,
            text:"Кровоспинний джгут треба затягувати на кінцівці:",
            answers:["До появи болю.",
                "До зупинки кровотечі.",
                "Скільки є сили."],
            trueAnswer:"До зупинки кровотечі."
        },
        {id:10,
            text:"Яких заходів повинен вжити водій, перед тим як залишити свій транспортний засіб?",
            answers:["Заходи щодо запобігання самовільного руху автомобіля.",
                "Заходи щодо запобігання проникнення до нього і (або) незаконного заволодіння ним.",
                "Відповіді 1 і 2."
            ],
            trueAnswer:"Відповіді 1 і 2."
        },
        {id:11,
            text:"У якому випадку заборонено в'їжджати на попутні трамвайні колії, розташовані на одному рівні з проїзною частиною?",
            answers:["Коли рух по ній заборонено дорожніми знаками чи дорожньою розміткою.",
                "Коли ширина проїзної частини достатня для виконання об'їзду без виїзду на трамвайну колію.",
                "Якщо в разі виїзду на трамвайну колію створюється перешкода для руху трамвая.",
                "Відповіді 1 і 2.",
                "Відповіді 1, 2 і 3."
            ],
            trueAnswer:"Відповіді 1, 2 і 3."
        },
        {id:12,
            text:"Що вмикається на транспортному засобі під час вимушеної зупинки на дорозі в темну пору доби?",
            answers:["Аварійна сигналізація.",
                "Протитуманні фари.",
                "Габаритні або стоянкові ліхтарі.",
                "Габаритні або стоянкові ліхтарі спільно з аварійною сигналізацією."
            ],
            trueAnswer:"Габаритні або стоянкові ліхтарі спільно з аварійною сигналізацією."
        },
        {id:13,
            text:"Чи узгоджується з територіальними органами з надання сервісних послуг МВС встановлення світлових покажчиків і розпізнавальних знаків автомобілів аварійної служби?",
            answers:["Узгоджується.",
                "Не узгоджується.",
                "Узгоджується лише встановлення світлових покажчиків."
            ],
            trueAnswer:"Узгоджується."
        },
        {id:14,
            text:"У якому випадку дозволяється експлуатація транспортного засобу?",
            answers:["На світлових приладах використовуються розсіювачі, що не відповідають типу конкретного світлового приладу.\n",
                "Відсутні протитуманні фари.",
                "Порушено регулювання фар.\n"
            ],
            trueAnswer:"Відсутні протитуманні фари."
        },
        {id:15,
            text:"Яку максимальну кількість пасажирів Ви, як водій з категорією В, маєте право перевозити?",
            answers:["Не більше 9, не враховуючи місце водія.",
                "Не більше 8, не враховуючи місце водія.",
                "Не більше 7.",
                "Не більше 5."
            ],
            trueAnswer:"Не більше 8, не враховуючи місце водія."
        },
        {id:16,
            text:"Що необхідно зробити перед відкриттям капота, якщо з-під нього йде дим?",
            answers:["Вимкнути двигун і дистанційний вимикач «маси» (при його наявності).",
                "Дістати вогнегасник і підготувати його до використання.\n",
                "Захистити руки від опіку, надівши рукавички або обернувши пальці ганчір'ям.\n",
                "Все перераховане.\n"
            ],
            trueAnswer:"Все перераховане.\n"
        },
        {id:17,
            text:"В яких випадках водій має право відступати від вимог законодавства?",
            answers:["В умовах дії непереборної сили.",
                "Коли іншими засобами неможливо запобігти власній загибелі чи каліцтву громадян.",
                "У випадках, зазначених в пунктах 1 та/або 2."
            ],
            trueAnswer:"У випадках, зазначених в пунктах 1 та/або 2."
        },
        {id:18,
            text:"Ким проводиться огляд на стан сп’яніння:",
            answers:["Будь яким лікарем.",
                "Поліцейським на місці зупинки транспортного засобу в присутності двох свідків.",
                "Лікарем закладу охорони здоров’я, який має право на проведення такого огляду.",
                "Відповіді 1,2,3.",
                "Відповіді 2 і 3."
            ],
            trueAnswer:"Відповіді 2 і 3."
        },
        {id:19,
            text:"Як найбезпечніше проїхати перехрестя, якщо при наближенні до нього Ви бачите зелений миготливий сигнал світлофора?",
            answers:["Завчасно знизити швидкість, щоб у разі потреби зупинитися перед «стоп-лінією» при ввімкненні заборонного сигналу світлофора, не вдаючись до екстреного гальмування.",
                "Збільшити швидкість, щоб встигнути проїхати перехрестя до ввімкнення заборонного сигналу світлофора.",
                "Не змінювати швидкість руху, а якщо до ввімкнення червоного сигналу проїхати перехрестя не вдасться - загальмувати перед «стоп-лінією»."
            ],
            trueAnswer:"Завчасно знизити швидкість, щоб у разі потреби зупинитися перед «стоп-лінією» при ввімкненні заборонного сигналу світлофора, не вдаючись до екстреного гальмування."
        },
        {id:20,
            text:"Порядок дій при масивній артеріальній кровотечі:",
            answers:["Викликати 103 і накласти пов'язку, що тисне.",
                "Викликати 103, накласти джгут, вказати час накладання.",
                "Накласти джгут, вказати час накладання, викликати 103."
            ],
            trueAnswer:"Накласти джгут, вказати час накладання, викликати 103."
        },

    ],
    c:[
        {},
        {id:1,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:2,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:3,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:4,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:5,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:6,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:7,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:8,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:9,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:10,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:11,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:12,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:13,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:14,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:15,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:16,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:17,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:18,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:19,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:20,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },

    ],
    d:[
        {},
        {id:1,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:2,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:3,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:4,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:5,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:6,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:7,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:8,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:9,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:10,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:11,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:12,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:13,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:14,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:15,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:16,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:17,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:18,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:19,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:20,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },

    ],
    be:[
        {},
        {id:1,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:2,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:3,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:4,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:5,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:6,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:7,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:8,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:9,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:10,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:11,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:12,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:13,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:14,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:15,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:16,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:17,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:18,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:19,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:20,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },

    ],
    t:[
        {},
        {id:1,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:2,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:3,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:4,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:5,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:6,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:7,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:8,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:9,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:10,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:11,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:12,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:13,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:14,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:15,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:16,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:17,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:18,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:19,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },
        {id:20,
            text:"",
            answers:[
                "",
                "",
                "",
                "",
                ""
            ],
            trueAnswer:""
        },

    ],
}
const  testReducer = (state = initialState,action) => {
    switch (action.type) {

        default:
            return state;
    }
}

export default testReducer;